#include <stdio.h>

int main(){
    double x=1.0, y=2.0, z;//เก็บค่าตัวแปร
    
    printf("x=%.1f y=%.1f z=%.1f\n", x, y, z);//แสดงค่าตัวแปรทั้งหมด
    printf("x=%.1f",x=y+5.0);//คำนวณค่า x จาก y + 5.0
    printf(" ค่าตัวแปรx=%.1f y=%.1f z=%.1f\n", x, y, z);//แสดงค่าตัวแปรหลังคำนวณ
    printf("y=%.1f",y=x/2.0);//คำนวณค่า y จาก x / 2.0
    printf(" ค่าตัวแปรx=%.1f y=%.1f z=%.1f\n", x, y, z);//แสดงค่าตัวแปรหลังคำนวณ
    printf("y=%.1f",y=(x*3.0)+4.0);//คำนวณค่า y จาก (x * 3.0) + 4.0
    printf(" ค่าตัวแปรx=%.1f y=%.1f z=%.1f\n", x, y, z);//แสดงค่าตัวแปรหลังคำนวณ
    printf("x=%.1f",x=-0.5-y);//คำนวณค่า x จาก -0.5 - y
    printf(" ค่าตัวแปรx=%.1f y=%.1f z=%.1f\n", x, y, z);//แสดงค่าตัวแปรหลังคำนวณ
    printf("z=%.1f",z=x+y);//คำนวณค่า z จาก x + y
    printf(" ค่าตัวแปรx=%.1f y=%.1f z=%.1f\n", x, y, z);//แสดงค่าตัวแปรหลังคำนวณ
    
    return 0;
}